zenes/esp32s3-TAS/examples/eth2ap/eth2ap.ino
void refreshLine() {
  // Move cursor to beginning of line (using \r)
  Serial.print("\r> ");
  // Print current inputString
  Serial.print(inputString);
  // Clear any leftover characters from previous longer string
  Serial.print("\033[K"); 
  // Move cursor back to current cursor_pos
  if (cursor_pos < inputString.length()) {
    Serial.printf("\033[%dD", (int)(inputString.length() - cursor_pos));
  }
}

void installHooks() {
  esp_netif_t* eth_netif = ETH.netif();
#if ESP_ARDUINO_VERSION < ESP_ARDUINO_VERSION_VAL(3, 0, 0)
  esp_netif_t* ap_netif = esp_netif_get_handle_from_ifkey("WIFI_AP_DEF");
#else
  esp_netif_t* ap_netif = WiFi.AP.netif();
#endif

  if (eth_netif && orig_eth_input == NULL) {
    struct netif* lwip_eth = (struct netif*)esp_netif_get_netif_impl(eth_netif);
    if (lwip_eth) {
      orig_eth_input = lwip_eth->input;
      orig_eth_linkoutput = lwip_eth->linkoutput;
      lwip_eth->input = eth_input_hook;
      lwip_eth->linkoutput = eth_linkoutput_hook;
      logMsg(LOG_INFO, "ETH Hooks installed (Handle: %p, netif: %p)", eth_netif, lwip_eth);
    }
  }

  if (ap_netif && orig_ap_input == NULL) {
    struct netif* lwip_ap = (struct netif*)esp_netif_get_netif_impl(ap_netif);
    if (lwip_ap) {
      orig_ap_input = lwip_ap->input;
      orig_ap_linkoutput = lwip_ap->linkoutput;
      lwip_ap->input = ap_input_hook;
      lwip_ap->linkoutput = ap_linkoutput_hook;
      logMsg(LOG_INFO, "AP Hooks installed (Handle: %p, netif: %p)", ap_netif, lwip_ap);
    }
  }
}

// Command List for Autocomplete
const char* shell_commands[] = {
  "help", "status", "dmesg", "loglevel", "monitor", "restart", "set_ssid", "set_pw", "stats", "traffic", "ping", "ifconfig", "arp", "dhcp", "iperf", "udp_iperf", "toe_iperf"
};
const int shell_cmd_count = sizeof(shell_commands) / sizeof(shell_commands[0]);

// Shell History
#define MAX_HISTORY 10
static String shell_history[MAX_HISTORY];
static int history_count = 0;
static int history_index = -1;

// Autocomplete Cycling
static int tab_match_index = -1;
static String tab_prefix = "";

// ANSI Sequence Parser State
static enum { ANSI_NONE, ANSI_ESC, ANSI_BRACKET } ansi_state = ANSI_NONE;

TFT_eSPI tft = TFT_eSPI(); // Invoke custom library
#define ENABLE_LCD // Enable logic, but will be checked dynamically
static bool lcd_initialized = false;
static bool lcd_detected = false;

/* LVGL Buffer */
static lv_disp_draw_buf_t draw_buf;
static lv_color_t buf[LCD_WIDTH * 20];

/* UI Objects */
static lv_obj_t *ui_label_eth;
static lv_obj_t *ui_label_ap;
static lv_obj_t *ui_label_clients;

/* Display flushing callback */
void my_disp_flush(lv_disp_drv_t *disp, const lv_area_t *area, lv_color_t *color_p) {
  uint32_t w = (area->x2 - area->x1 + 1);
  uint32_t h = (area->y2 - area->y1 + 1);
  tft.startWrite();
  tft.setAddrWindow(area->x1, area->y1, w, h);
  tft.pushColors((uint16_t *)&color_p->full, w * h, true);
  tft.endWrite();
  lv_disp_flush_ready(disp);
}

// Network state
// ============================================================================
// Network Configuration (Static IP)
// Set USE_STATIC_IP to true if you want to use a static IP address.
// This is useful if DHCP is not available or slow (Example: Corporate Network).
// ============================================================================
#define USE_STATIC_IP true // Set to true to enable Static IP

#if USE_STATIC_IP
// Please change these values to match your network environment
IPAddress local_ip(192, 168, 0, 50);
IPAddress gateway(192, 168, 0, 100); // Set gateway to Device A (Direct Connect)
IPAddress subnet(255, 255, 255, 0);
IPAddress dns1(8, 8, 8, 8);
IPAddress dns2(8, 8, 4, 4);
#endif

// Network state
static bool eth_connected = false;
static bool ap_started = false;

/**
 * @brief Dynamic LCD hardware detection
 * @return true if LCD is detected, false otherwise
 */
bool detectLCD() {
  Serial.print("Probing LCD hardware (Register 0x04)... ");
  
  // Use a local SPI instance to probe without affecting global state
  SPIClass spi_probe(FSPI); // FSPI is SPI2_HOST on S3
  spi_probe.begin(LCD_SCLK_PIN, LCD_MISO_PIN, LCD_MOSI_PIN, LCD_CS_PIN);
  
  pinMode(LCD_MISO_PIN, INPUT_PULLUP); // Enable Pull-up on MISO
  pinMode(LCD_CS_PIN, OUTPUT);
  pinMode(LCD_DC_PIN, OUTPUT);
  pinMode(LCD_RST_PIN, OUTPUT);

  // Perform Hardware Reset before probing
  digitalWrite(LCD_RST_PIN, LOW);
  delay(10);
  digitalWrite(LCD_RST_PIN, HIGH);
  delay(120);
  
  digitalWrite(LCD_CS_PIN, LOW);
  
  // Try to Read Display ID (0x04)
  // ST7789/ILI9341 ID: dummy(1bit or 1byte), then ID1, ID2, ID3
  spi_probe.beginTransaction(SPISettings(1000000, MSBFIRST, SPI_MODE0));
  
  // Send Command 0x04
  digitalWrite(LCD_DC_PIN, LOW);
  spi_probe.transfer(0x04);
  
  // Read Data
  digitalWrite(LCD_DC_PIN, HIGH);
  spi_probe.transfer(0x00); // dummy byte
  uint8_t id1 = spi_probe.transfer(0x00);
  uint8_t id2 = spi_probe.transfer(0x00);
  uint8_t id3 = spi_probe.transfer(0x00);
  
  spi_probe.endTransaction();
  digitalWrite(LCD_CS_PIN, HIGH);
  spi_probe.end(); 

  Serial.printf("ID: %02X %02X %02X -> ", id1, id2, id3);
  
  // Floating inputs or disconnected miso usually return 0xFF or 0x00
  if ((id1 == 0xFF || id1 == 0x00) && (id2 == 0xFF || id2 == 0x00) && (id3 == 0xFF || id3 == 0x00)) {
    Serial.println("LCD Not Detected.");
    return false;
  }
  
  Serial.printf("LCD Detected! (Chip ID: %02X%02X%02X)\r\n", id1, id2, id3);
  return true;
}

/**
 * @brief Initialize LVGL UI widgets
 */
void initLVGLUI() {
  lv_obj_t *scr = lv_scr_act();
  lv_obj_set_style_bg_color(scr, lv_color_black(), 0);

  /* Title */
  lv_obj_t *title = lv_label_create(scr);
  lv_label_set_text(title, "ETH2AP Bridge");
  lv_obj_set_style_text_font(title, &lv_font_montserrat_14, 0);
  lv_obj_set_style_text_color(title, lv_palette_main(LV_PALETTE_YELLOW), 0);
  lv_obj_align(title, LV_ALIGN_TOP_MID, 0, 10);

  /* Separator */
  static lv_point_t line_points[] = {{0, 0}, {LCD_HEIGHT, 0}}; // Landscape orientation
  lv_obj_t *line = lv_line_create(scr);
  lv_line_set_points(line, line_points, 2);
  lv_obj_set_style_line_color(line, lv_palette_main(LV_PALETTE_GREY), 0);
  lv_obj_set_style_line_width(line, 2, 0);
  lv_obj_align(line, LV_ALIGN_TOP_MID, 0, 35);

  /* Ethernet Label */
  ui_label_eth = lv_label_create(scr);
  lv_label_set_recolor(ui_label_eth, true);
  lv_obj_set_style_text_color(ui_label_eth, lv_color_white(), 0);
  lv_obj_align(ui_label_eth, LV_ALIGN_TOP_LEFT, 10, 50);

  /* Access Point Label */
  ui_label_ap = lv_label_create(scr);
  lv_label_set_recolor(ui_label_ap, true);
  lv_obj_set_style_text_color(ui_label_ap, lv_color_white(), 0);
  lv_obj_align(ui_label_ap, LV_ALIGN_TOP_LEFT, 10, 80);

  /* Clients Info */
  ui_label_clients = lv_label_create(scr);
  lv_obj_set_style_text_color(ui_label_clients, lv_palette_lighten(LV_PALETTE_GREY, 1), 0);
  lv_obj_align(ui_label_clients, LV_ALIGN_TOP_LEFT, 10, 110);
}

/**
 * @brief Update LCD with current network status (LVGL version)
 */
void updateLCD() {
#ifdef ENABLE_LCD
  if (!lcd_initialized) {
    return;
  }

  // Update Ethernet Status Label
  if (eth_connected) {
    char buf_eth[64];
    snprintf(buf_eth, sizeof(buf_eth), "ETH: #00FF00 Connected#\n IP: %s", ETH.localIP().toString().c_str());
    lv_label_set_text(ui_label_eth, buf_eth);
  } else {
    lv_label_set_text(ui_label_eth, "ETH: #FF0000 Disconnected#");
  }

  // Update AP Status Label
  if (ap_started) {
    char buf_ap[64];
    snprintf(buf_ap, sizeof(buf_ap), "AP: #00FF00 Running#\n SSID: %s", ap_ssid_custom.c_str());
    lv_label_set_text(ui_label_ap, buf_ap);

    char buf_clients[32];
    snprintf(buf_clients, sizeof(buf_clients), "Clients: %d / %d", WiFi.softAPgetStationNum(), AP_MAX_CONN);
    lv_label_set_text(ui_label_clients, buf_clients);
  } else {
    lv_label_set_text(ui_label_ap, "AP: #FF0000 Stopped#");
    lv_label_set_text(ui_label_clients, "");
  }
#endif
}

/**
 * @brief Handle Serial Shell Commands
 */
void handleShell() {
  while (Serial.available()) {
    char inChar = (char)Serial.read();

