zenes/esp32s3-TAS/examples/eth2ap/eth2ap.ino
    inputString = "";
    stringComplete = false;
    Serial.print("> "); // Prompt for next command
  }
}

/**
 * @brief WiFi and Ethernet event handler
 *
 * Handles connection events for both Ethernet and WiFi AP interfaces.
 * When Ethernet gets an IP, starts the WiFi AP and enables NAPT for packet
 * forwarding.
 */
void NetworkEvent(arduino_event_id_t event) {
  switch (event) {
#ifdef ENABLE_ETHERNET
  case ARDUINO_EVENT_ETH_START:
    logMsg(LOG_INFO, "ETH Started");
    ETH.setHostname("eth2ap-bridge");
    installHooks(); // Try installing hooks on start
    break;

  case ARDUINO_EVENT_ETH_CONNECTED:
    logMsg(LOG_INFO, "ETH Connected");
    installHooks(); // Re-verify hooks on connection
    break;

  case ARDUINO_EVENT_ETH_GOT_IP:
    logMsg(LOG_INFO, "ETH MAC: %s, IPv4: %s, %s, %d Mbps", 
           ETH.macAddress().c_str(), ETH.localIP().toString().c_str(),
           ETH.fullDuplex() ? "FULL_DUPLEX" : "HALF_DUPLEX", ETH.linkSpeed());
    eth_connected = true;

#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    if (WiFi.AP.enableNAPT(true)) {
      logMsg(LOG_INFO, "NAPT enabled - Bridge is active");
    } else {
      logMsg(LOG_ERROR, "NAPT enable failed!");
    }
#endif
    break;

  case ARDUINO_EVENT_ETH_DISCONNECTED:
    logMsg(LOG_WARN, "ETH Disconnected");
    eth_connected = false;
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    WiFi.AP.enableNAPT(false);
#endif
    break;

  case ARDUINO_EVENT_ETH_STOP:
    logMsg(LOG_INFO, "ETH Stopped");
    eth_connected = false;
    break;
#endif

  case ARDUINO_EVENT_WIFI_AP_START:
    logMsg(LOG_INFO, "WiFi AP Started (SSID: %s, IP: %s)", ap_ssid_custom.c_str(), WiFi.softAPIP().toString().c_str());
    ap_started = true;
    break;

  case ARDUINO_EVENT_WIFI_AP_STOP:
    logMsg(LOG_INFO, "WiFi AP Stopped");
    ap_started = false;
    break;

  case ARDUINO_EVENT_WIFI_AP_STACONNECTED:
    logMsg(LOG_INFO, "WiFi AP: Station connected");
    break;

  case ARDUINO_EVENT_WIFI_AP_STADISCONNECTED:
    logMsg(LOG_INFO, "WiFi AP: Station disconnected");
    break;

  default:
    break;
  }
  // Update LCD on any major network event
  updateLCD();
}

void setup() {
  Serial.begin(115200);
  delay(1000); // Wait for Serial to stabilize

  esp_reset_reason_t reason = esp_reset_reason();
  Serial.printf("\n\n[System] Reset Reason: %d\n", reason);

  Serial.println("===== eth2ap Bridge Example =====");
  Serial.println("Ethernet to WiFi AP Bridge using NAPT");
  Serial.println("=====================================\n");
  Serial.print("> "); // Initial prompt

  // Step 0: Load saved settings from NVS
  preferences.begin("wifi-config", false); // Open in read-write mode to save if not exists
  if (!preferences.isKey("ssid")) {
    preferences.putString("ssid", ap_ssid_custom);
    preferences.putString("password", ap_pw_custom);
  } else {
    ap_ssid_custom = preferences.getString("ssid", AP_SSID_BASE);
    ap_pw_custom = preferences.getString("password", AP_PASSWORD_BASE);
  }
  preferences.end();
  logMsg(LOG_INFO, "Loaded settings: SSID='%s'", ap_ssid_custom.c_str());

  // Step 1: Start WiFi AP immediately (Always-On Priority)
  logMsg(LOG_INFO, "Step 1: Starting WiFi AP (softAP)... %s", 
    WiFi.softAP(ap_ssid_custom.c_str(), ap_pw_custom.c_str(), AP_CHANNEL, 0, AP_MAX_CONN) ? "Success" : "FAILED");

  esp_err_t err = esp_wifi_set_bandwidth(WIFI_IF_AP, WIFI_BW_HT40);
  logMsg(LOG_INFO, "Step 2: Setting WiFi Bandwidth to HT40... %s", (err == ESP_OK) ? "Success" : "FAILED");

  logMsg(LOG_INFO, "Step 3: Checking AP Status... SSID: %s, IP: %s", 
         ap_ssid_custom.c_str(), WiFi.softAPIP().toString().c_str());
  ap_started = true;

  // Step 4: Setting up WiFi events
  Serial.print("Step 4: Registering Network Events... ");
  WiFi.onEvent(NetworkEvent);
  Serial.println("Done.");

  Serial.println("\n[Note] WiFi AP is running.");
  Serial.println("       Internet access will be available after Ethernet connection.\n");

  // Step 5: Initialize LCD (Dynamically detected)
#ifdef ENABLE_LCD
  lcd_detected = detectLCD();
  if (lcd_detected) {
    Serial.print("Step 5: Initializing LCD Pins... ");
    pinMode(LCD_BL_PIN, OUTPUT);
    digitalWrite(LCD_BL_PIN, HIGH); // Turn on backlight
    Serial.println("Done.");

    Serial.print("Step 6: tft.init() and LVGL Setup... ");
    tft.init();
    
    /* Initialize LVGL */
    lv_init();
    lv_disp_draw_buf_init(&draw_buf, buf, NULL, LCD_WIDTH * 20);

    /* Initialize the display driver for LVGL */
    static lv_disp_drv_t disp_drv;
    lv_disp_drv_init(&disp_drv);
    disp_drv.hor_res = LCD_HEIGHT; // Landscape
    disp_drv.ver_res = LCD_WIDTH;  // Landscape
    disp_drv.flush_cb = my_disp_flush;
    disp_drv.draw_buf = &draw_buf;
    lv_disp_drv_register(&disp_drv);

    lcd_initialized = true; 
    Serial.println("Done.");

    Serial.print("Step 7: LVGL UI creation... ");
    tft.setRotation(1); // Landscape
    initLVGLUI();
    updateLCD();
    Serial.println("Done.");
  } else {
    Serial.println("Step 5-7: LCD Hardware not found. Skipping.");
  }
#else
  Serial.println("Step 5-7: LCD Feature Disabled.");
#endif

  // Step 8: Initialize Ethernet
#ifdef ENABLE_ETHERNET
  logMsg(LOG_INFO, "Step 8: Initializing Ethernet...");

#if CONFIG_IDF_TARGET_ESP32
  ETH.begin(ETH_TYPE, ETH_ADDR, ETH_MDC_PIN, ETH_MDIO_PIN, ETH_RESET_PIN, ETH_CLK_MODE);
#else
  ETH.begin(ETH_PHY_W5500, ETH_ADDR, ETH_CS_PIN, ETH_INT_PIN, ETH_RST_PIN,
            SPI3_HOST, ETH_SCLK_PIN, ETH_MISO_PIN, ETH_MOSI_PIN, 40);
#endif

#if USE_STATIC_IP
  ETH.config(local_ip, gateway, subnet, dns1, dns2);
#endif

  logMsg(LOG_INFO, "Ethernet initialization command sent");
  
  // Final Step: Install Hooks
  installHooks(); 
#else
  logMsg(LOG_WARN, "Step 8: Ethernet Feature Disabled (#define ENABLE_ETHERNET).");
#endif

  Serial.println("Waiting for Ethernet connection to enable internet sharing...");
  logMsg(LOG_INFO, "System ready. Type 'help' for commands.");
}

void loop() {
  // Print status every 5 seconds (Changed from 30 for debugging)
  static unsigned long lastStatusPrint = 0;
  unsigned long currentMillis = millis();

  if (currentMillis - lastStatusPrint >= 5000) {
    lastStatusPrint = currentMillis;

    if (monitor_enabled) {
      logMsg(LOG_INFO, "----- Status -----");
#ifdef ENABLE_ETHERNET
      logMsg(LOG_INFO, "Ethernet: %s", eth_connected ? "Connected" : "Disconnected");
      if (eth_connected) {
        logMsg(LOG_INFO, "  IP: %s", ETH.localIP().toString().c_str());
      }
#endif
      logMsg(LOG_INFO, "WiFi AP : %s", ap_started ? "Running" : "Stopped");
      if (ap_started) {
        logMsg(LOG_INFO, "  Clients: %d", WiFi.softAPgetStationNum());
      }
      logMsg(LOG_INFO, "------------------\r\n");
    }

#ifdef ENABLE_ETHERNET
    if (monitor_traffic) {
        unsigned long now = millis();
        if (now - last_speed_check >= 2000) {
          last_speed_check = now;
          Serial.printf("[Monitor] ETH RX: %s, TX: %s | AP RX: %s, TX: %s\r\n", 
                        formatBytes(eth_stats.rx_bytes).c_str(), formatBytes(eth_stats.tx_bytes).c_str(), 
                        formatBytes(ap_stats.rx_bytes).c_str(), formatBytes(ap_stats.tx_bytes).c_str());
        }
    }
#endif

    // Update LCD periodically
    updateLCD();
  }

  // Handle Serial Shell
  handleShell();

  // Handle UDP iPerf Reporting
#ifdef ENABLE_ETHERNET
  if (udp_iperf_running) {
    uint32_t now = millis();
    if (now - udp_iperf_last_print >= 1000) {
      // Calculate Mbps and MB/s
      float mbps = (udp_iperf_bytes * 8.0) / 1000000.0;
      float mb_s = udp_iperf_bytes / (1024.0 * 1024.0);
      
      Serial.printf("\r\n[UDP iPerf] %.2f MB/s  |  %.2f Mbps  (Received: %u Bytes)\r\n> ", mb_s, mbps, (unsigned int)udp_iperf_bytes);
      refreshLine();
      udp_iperf_bytes = 0; // Reset for next second
      udp_iperf_last_print = now;
    }
  }
#endif

  // Infinite Ping
  if (ping_running) {
    if (currentMillis - last_ping_time >= 1000) {
      last_ping_time = currentMillis;
      bool success = Ping.ping(ping_target.c_str(), 1);
      if (success) {
        Serial.printf("Reply from %s: time=%.2fms\r\n", ping_target.c_str(), Ping.averageTime());
      } else {
        Serial.printf("Request timeout for %s\r\n", ping_target.c_str());
      }
    }
  }

  // Update LVGL timer handler
  lv_timer_handler();

  delay(5);
}
